import numpy as np

# Направления оптимизации для критериев: 1 (максимизация), -1 (минимизация)
# Критерии: [Прибыль, Рабочие места, Возможности развития]
# В нашем задании ВСЕ критерии нужно максимизировать
OPTIMIZATION_GOALS = np.array([1, 1, 1])

# Оцифровка качественных оценок по шкале Харрингтона:
# "очень хорошие" -> 0.9
# "хорошие" -> 0.7
# "средние" -> 0.55
# "средние (немного хуже)" -> 0.45
PROJECTS_DATA = [
    {"id": "П1", "metrics": [12, 3000, 0.7]},
    {"id": "П2", "metrics": [10, 3500, 0.55]},
    {"id": "П3", "metrics": [13, 3000, 0.45]},
    {"id": "П4", "metrics": [11, 1500, 0.7]},
    {"id": "П5", "metrics": [15, 2000, 0.9]},
    {"id": "П6", "metrics": [14, 2500, 0.9]}
]

# Ранжирование экспертов (3 - наиболее важный, 2 - менее важный, 1 - наименее важный)
# Индексы соответствуют: [Прибыль, Рабочие места, Развитие]
# Эксперт 1: Прибыль (3), Развитие (2), Рабочие места (1) -> [3, 1, 2]
# Эксперт 2: Прибыль (3), Рабочие места (2), Развитие (1) -> [3, 2, 1]
EXPERT_EVALUATIONS = np.array([
    [3, 1, 2],
    [3, 2, 1]
])